class Repository {
    
    getLessons() {
        //TODO add db
        return [
            'Д43 Сальса гр.1107 (ПТ 20:00-22:00 с 22.07.2022) Елена Ромащенко и JJ места для парней и пар',
            'Д43 Сальса (Мамбо, Нью-Йорк) гр.1076 (ВТ 20:00-22:00 с 18.01.2022) Елена Ромащенко и JJ места для парней и пар',
            'Д43 Сальса (Мамбо, Нью-Йорк) гр.1041 (ПН СР 19:00-20:00 с 28.06.2021) Дарья Евченко и JJ места для парней и пар'
        ];
    }

    getFreeSlots() {
        //TODO add db
        return [
            'Вторник 18 00 - 19 00',
            'Среда 21 00 - 22 00',
            'Суббота 14 00 - 15 00'
        ];
    }
}

module.exports = Repository;